# EXAMPLE : 01

In [ ]:
import pandas as pd

In [73]:
data = {
    "Name": ["Alice ", "bob", "CHARLIE", "david", None],
    "Age": ["25", "thirty", "35", None, "40 "],
    "Salary": ["50000", "60000$", "NaN", "45000", "52000 "],
    "Department": ["HR", "IT", "it", "Finance ", None]
}

df = pd.DataFrame(data)
print(df.dtypes)
df

Name          object
Age           object
Salary        object
Department    object
dtype: object

      Name     Age  Salary Department
0   Alice       25   50000         HR
1      bob  thirty  60000$         IT
2  CHARLIE      35     NaN         it
3    david    None   45000   Finance
4     None     40   52000        None

In [74]:
# Clean Name Column
df['Name'] = df['Name'].str.strip().str.capitalize()
df

      Name     Age  Salary Department
0    Alice      25   50000         HR
1      Bob  thirty  60000$         IT
2  Charlie      35     NaN         it
3    David    None   45000   Finance
4     None     40   52000        None

In [ ]:
# Clean Age Column
df['Age'] = df['Age'].replace('thirty', 30)
df['Age'] = df['Age'].fillna(df['Age'].median())
df['Age'] = pd.to_numeric(df['Age'])
df

In [ ]:
df['Salary'] = df['Salary'].astype(str).str.strip().str.replace('$', '')
df['Salary'] = pd.to_numeric(df['Salary'], errors='coerce')
df['Salary'] = df['Salary'].fillna(df['Salary'].median())
df

In [ ]:
# Clean Department Column
df['Department'] = df['Department'].str.strip().str.upper()
df['Department'] = df['Department'].fillna('UNKNOWN')
df

# EXAMPLE : 02